<template>
    <aside class="product-cart-view-modal modal fade" id="action-TermOfUse" tabindex="-1" aria-hidden="true">
        <div class="modal-dialog modal-dialog-centered">
            <div class="modal-content">
                <div class="modal-body">
                    <div class="product-quick-view-content">
                        <button type="button" class="btn-close" data-bs-dismiss="modal">
                            <span class="fa fa-close"></span>
                        </button>
                        <div class="container" style="margin-left: 30px">
                            <div class="row">
                                <h3>Угода користувача</h3>
                                <p>Оформлюючи замовлення Користувач, погоджується на обробку та використання своїх персональних даних (а саме, на використання, внесення до бази даних, розповсюдження, передачу третім особам, доповнення чи інші зміни, видалення й інші дії, котрі може здійснювати Адміністрація Сайту з персональними даними в письмовій(паперовій), електронній чи іншій формі), включаючи, але не обмежуючись, такими даними: ім’я, прізвище, по-батькові, дата народження, паспортні дані, особисте зображення(фото і відео), контактна інформація(адреса, телефон), а також інша інформація , котра реалізується Адміністрацією Сайту або третіми особами через справжній веб-сайт, а також, з метою захисту прав споживачів і з метою ведення Адміністрацією Сайту господарської діяльності, ведення статистики, з метою ведення бухгалтерського та податкового обліку, для комунікації та договірних відносин з державними органами, контрагентами та іншими третіми особами в ході здійснення господарської діяльності, для дотримання внутрішніх правил та процедур в процесі діяльності Сайту, а також для інших цілей, які не суперечать діючому законодавству.</p>
                                <p>Крім вказаного вище, Користувач надає свою згоду на те, що в разі необхідності, персональні дані можуть бути оброблені та переслані (передані) третім особам у межах реалізації цілі, що вказана вище.  Крім цього Користувач підтверджує свою згоду на те, що персональні дані можуть бути передані за межі національного кордону України та будуть видимі в країнах, в яких менш сурові правила захисту персональних даних, ніж в Україні. Користувач підтверджує, що внесення персональних даних в базу(бази) даних, передача, розповсюдження, зміна та інша обробка Сайтом персональних даних Користувача з вищевказаною метою не потребує додаткового сповіщення про такі дії.</p>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </aside>
</template>

<script>
    export default {
        name: "term_of_use_modal"
    }
</script>

<style scoped>

</style>
